T1059.001 - PowerShell Execution

index=* sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=1
| search Image="*powershell.exe*" OR ParentImage="*powershell.exe*"
| table _time, host, user, Image, ParentImage, CommandLine, ParentCommandLine
| sort -_time

T1055.001 - Process Injection

index=* sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=1
| search CommandLine IN ("*WriteProcessMemory*", "*CreateRemoteThread*", "*VirtualAllocEx*", "*injection*")
| table _time, host, user, Image, ParentImage, CommandLine
| sort -_time


T1053.005 - Scheduled Task Creation

index=* sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=1
| search CommandLine IN ("*schtasks*", "*New-ScheduledTask*", "*Register-ScheduledTask*", "*Task Scheduler*")
| table _time, host, user, Image, ParentImage, CommandLine
| sort -_time
